Repository: Rhoxolan/Structured-Cabling-Studio
Catalog: Structured Cabling Studio/Resources/Views/Project/ProjectInformation.*.resx
Languages: ru

source: Author of project
ru: Автор проекта

source: Eight paragraph &amp; link to the SCS-Calc 2.0 repo
ru: Релиз приложения SCS-Calc 2.0 состоялся в феврале 2023-го. По совместительству, приложение стало предметом курсовой работы по платформе .NET в Компьтерной Академии ШАГ г. Кривой Рог.<br /> Более подбробно ознакомиться с приложением можно на GitHub

source: Fifth paragraph - link to the SCS-Calc 1.1 repo
ru: Код приложения SCS-Calc 1.1 доступен на GitHub

source: First paragraph
ru: В августе 2021-го, во время написания курсовой работы по предмету "Структурированные кабельные системы" в Компьтерной Академии ШАГ г. Кривой Рог, возникла необходимость в созднии программного обеспечения для расчета необходимого для построения СКС метража кабеля. Была написана первая версия приложения - консольное приложение на языке C++, которое получило название SCS-Calc.

source: First&amp;second image description
ru: Первая, консольная версия приложения SCS-Calc

source: Fourth paragraph
ru: Проект развивался. В августе 2022-го была начата работа над версией 1.1. Одним из основных направлений разработки было создание меню дополнительных параметров, где пользователь мог настроить параметры расчета.<br/> При работе над версией 1.1 началась работа над новой архитектурной концепцией проекта. Для возможности переноса приложения на другие платформы разработки, была начата работа над созданием независимой от типа приложения кросплатформенной библиотеки, содержащей модель логики работы приложения. Это сыграло значительную роль в следующих версиях проекта, позволив перенести логическое ядро приложения на другие платформы.

source: Fourth&amp;fifth image description
ru: SCS-Calc 1.1

source: History of project
ru: История проекта

source: Img.
ru: Рис.

source: Profile
ru: Профиль

source: Second paragraph
ru: Однако, уже тогда было понимание того, что необходимо, в первую очередь, приложение с графическим интерфейсом пользователя.<br/> Что и было сделано в июне 2022-го - на языке C#, на платформе .NET 6 Windows Forms, была написана первая версия приложения с графическим интерфейсом пользователя. Приложение получило релизный индекс 1.0.

source: Seventh paragraph
ru: Приложение SCS-Calc 2.0 стало совершенно новым, современным и функциональным приложением. Приложение было написано на более современной платформе разработки - .NET 7 WPF. В значительной степени был доработан функционал приложения, была добавлена возможность получения рекомендаций по побдору кабеля. Переход на новую платформу позволил реализовать совершенно новый, революционный дизайн.

source: Sixth image description
ru: SCS-Calc 2.0

source: Sixth paragraph
ru: Но версия 1.1 так и не была опубликована - работа над версией 1.1 плавно перетекла в работу над версией 2.0.<br />

source: Third image description
ru: Приложение SCS-Calc - десктопная версия

source: Third paragraph - link to the SCS-Calc repo
ru: Более подробно ознакомиться с приложением SCS-Calc можно на GitHub
